{
    "Geometry": [
        {
            "id": "overview",
            "title": "Introduction to Geometry",
            "content": "Geometry is a branch of mathematics concerned with the properties and relations of points, lines, surfaces, solids, and higher-dimensional analogs. The most common form studied is Euclidean geometry, named after the ancient Greek mathematician Euclid, whose treatise 'Elements' provided the foundational axioms and postulates that define our standard understanding of space.\n\nEuclidean geometry operates in a flat, two- or three-dimensional space where the shortest distance between two points is a straight line. Key concepts include congruence (shapes being the same size and shape) and similarity (shapes being the same shape but possibly different sizes). It remains the basis for most practical applications in architecture, engineering, physics, and computer graphics. Other branches of geometry, such as non-Euclidean geometry (like hyperbolic and elliptic geometry), explore curved spaces where Euclid's fifth postulate (the parallel postulate) does not hold, which is essential for understanding phenomena like general relativity."
        },
        {
            "id": "basic-elements",
            "title": "Basics tests and Postulates",
            "content": "The foundation of geometry rests on three undefined terms: point, line, and plane. A point is a location in space with no size or dimension; it is represented by a dot and named with a single capital letter. A line is a set of points extending infinitely in two opposite directions, having one dimension (length) but no thickness. A plane is a flat, two-dimensional surface that extends infinitely in all directions.\n\nThese elements are governed by axioms (self-evident truths) and postulates (statements accepted without proof). One of the most critical is the postulate that states: Through any two points, there is exactly one line. Another defines segments and rays, which are parts of a line. A line segment is a section of a line bounded by two distinct endpoints, while a ray is a section of a line that has one endpoint and extends infinitely in one direction. Shutterstock\n\nLines can be parallel (never intersect and are coplanar), skew (never intersect and are not coplanar, only in 3D), or intersecting (meet at exactly one point). When two lines intersect, they form angles, which are measured in degrees or radians."
        },
        {
            "id": "2d-polygons",
            "title": "Two-Dimensional",
            "content": "Two-dimensional (2D) geometry primarily deals with shapes that can be drawn on a plane. A polygon is a closed 2D shape whose sides are all straight line segments. Polygons are classified by the number of sides they have, such as triangles (3 sides), quadrilaterals (4 sides), pentagons (5 sides), and hexagons (6 sides).\n\nTriangles are the simplest polygons and can be classified by their sides (equilateral, isosceles, scalene) or their angles (acute, right, obtuse). The sum of the interior angles of any triangle is always $180^\\circ$. Quadrilaterals include squares, rectangles, rhombi, parallelograms, and trapezoids, each having specific properties regarding side length and angle measure. Getty ImagesExplore\n\nKey calculations for 2D shapes involve perimeter (the total length around the boundary of the shape) and area (the measure of the surface enclosed by the shape). The area of a triangle is calculated as $A = \\frac{1}{2}bh$ (base times height), and the area of a circle (a non-polygon shape defined by all points equidistant from a central point) is $A = \\pi r^2$."
        },
        {
            "id": "3d-solids",
            "title": "Three-Dimensional",
            "content": "Three-dimensional (3D) geometry introduces depth and volume. Polyhedra are 3D solids whose faces are all polygons (e.g., cubes, pyramids, prisms). They are classified by the number of faces, vertices (corners), and edges they possess, which are related by Euler's formula: $V - E + F = 2$, where V is the number of vertices, E is the number of edges, and F is the number of faces.\n\nOther common 3D solids include those with curved surfaces, such as the sphere (all points equidistant from a center point), the cylinder (two circular bases connected by a curved surface), and the cone (a circular base that tapers to a single vertex). ShutterstockExplore\n\nKey calculations for 3D shapes involve surface area (the total area of the exterior surfaces of the solid) and volume (the amount of space occupied by the solid). For example, the volume of a sphere is $V = \\frac{4}{3}\\pi r^3$, and the volume of a rectangular prism is $V = lwh$ (length $\\times$ width $\\times$ height)."
        },
        {
            "id": "coordinate-geometry",
            "title": "Coordinate and Cartesian",
            "content": "Coordinate geometry, or analytic geometry, connects geometric concepts with algebra by placing figures on a coordinate system. The standard system is the Cartesian coordinate plane, defined by perpendicular number lines—the horizontal $x$-axis and the vertical $y$-axis—intersecting at the origin $(0, 0)$. A point's position is uniquely identified by an ordered pair of coordinates $(x, y)$.\n\nThis framework allows geometric properties to be proven algebraically. For instance, the distance formula, derived from the Pythagorean theorem ($a^2 + b^2 = c^2$), calculates the distance $d$ between two points $(x_1, y_1)$ and $(x_2, y_2)$: $d = \\sqrt{(x_2 - x_1)^2 + (y_2 - y_1)^2}$.\n\nThe slope of a line, $m$, represents its steepness and direction, calculated as the change in $y$ divided by the change in $x$: $m = \\frac{y_2 - y_1}{x_2 - x_1}$. Lines can be represented by algebraic equations, such as the slope-intercept form $y = mx + b$, where $b$ is the $y$-intercept. This ability to convert geometric figures into equations is fundamental to modern mathematics and physics."
        }
    ]
}
